ycsb/logs/RDMA_BP_8_async_th_28/workloadd.log
Select RDMA Busy Polling mode
Select RDMA Busy Polling mode
Select RDMA Busy Polling mode
[...]
total zerocopy send size = 0, total send size = 22119445, 0.000000
[OVERALL], RunTime(ms), 3893
[OVERALL], OP, 100000
[OVERALL], Throughput(ops/sec), 25687.130747495507
[TOTAL_GCS_PS_Scavenge], Count, 0
[TOTAL_GC_TIME_PS_Scavenge], Time(ms), 0
[TOTAL_GC_TIME_%_PS_Scavenge], Time(%), 0.0
[TOTAL_GCS_PS_MarkSweep], Count, 0
[TOTAL_GC_TIME_PS_MarkSweep], Time(ms), 0
[TOTAL_GC_TIME_%_PS_MarkSweep], Time(%), 0.0
[TOTAL_GCs], Count, 0
[TOTAL_GC_TIME], Time(ms), 0
[TOTAL_GC_TIME_%], Time(%), 0.0
[READ], Operations, 95079
[READ], AverageLatency(us), 37.04973758663848
[READ], MinLatency(us), 21
[READ], MaxLatency(us), 2927
[READ], 95thPercentileLatency(us), 55
[READ], 99thPercentileLatency(us), 71
[READ], Return=OK, 95079
[CLEANUP], Operations, 1
[CLEANUP], AverageLatency(us), 3917.0
[CLEANUP], MinLatency(us), 3916
[CLEANUP], MaxLatency(us), 3917
[CLEANUP], 95thPercentileLatency(us), 3917
[CLEANUP], 99thPercentileLatency(us), 3917
[INSERT], Operations, 4921
[INSERT], AverageLatency(us), 45.71469213574477
[INSERT], MinLatency(us), 28
[INSERT], MaxLatency(us), 505
[INSERT], 95thPercentileLatency(us), 65
[INSERT], 99thPercentileLatency(us), 97
[INSERT], Return=OK, 4921
total zerocopy send size = 0, total send size = 22103850, 0.000000
total zerocopy send size = 0, total send size = 22220905, 0.000000
[OVERALL], RunTime(ms), 4018
[OVERALL], OP, 100000
[OVERALL], Throughput(ops/sec), 24888.003982080638
[TOTAL_GCS_PS_Scavenge], Count, 0
[TOTAL_GC_TIME_PS_Scavenge], Time(ms), 0
[TOTAL_GC_TIME_%_PS_Scavenge], Time(%), 0.0
[TOTAL_GCS_PS_MarkSweep], Count, 0
[TOTAL_GC_TIME_PS_MarkSweep], Time(ms), 0
[TOTAL_GC_TIME_%_PS_MarkSweep], Time(%), 0.0
[TOTAL_GCs], Count, 0
[TOTAL_GC_TIME], Time(ms), 0
[TOTAL_GC_TIME_%], Time(%), 0.0
[READ], Operations, 95092
[READ], AverageLatency(us), 38.26529045555883
[READ], MinLatency(us), 22
[READ], MaxLatency(us), 2977
[READ], 95thPercentileLatency(us), 57
[READ], 99thPercentileLatency(us), 71
[READ], Return=OK, 95092
[CLEANUP], Operations, 1
[CLEANUP], AverageLatency(us), 3655.0
[CLEANUP], MinLatency(us), 3654
[CLEANUP], MaxLatency(us), 3655
[CLEANUP], 95thPercentileLatency(us), 3655
[CLEANUP], 99thPercentileLatency(us), 3655
[INSERT], Operations, 4908
[INSERT], AverageLatency(us), 47.59026079869601
[INSERT], MinLatency(us), 29
[INSERT], MaxLatency(us), 842
[INSERT], 95thPercentileLatency(us), 69
[INSERT], 99thPercentileLatency(us), 107
[INSERT], Return=OK, 4908
[OVERALL], RunTime(ms), 4023
[OVERALL], OP, 100000
[OVERALL], Throughput(ops/sec), 24857.071836937608
[TOTAL_GCS_PS_Scavenge], Count, 0
[TOTAL_GC_TIME_PS_Scavenge], Time(ms), 0
[TOTAL_GC_TIME_%_PS_Scavenge], Time(%), 0.0
[TOTAL_GCS_PS_MarkSweep], Count, 0
[TOTAL_GC_TIME_PS_MarkSweep], Time(ms), 0
[TOTAL_GC_TIME_%_PS_MarkSweep], Time(%), 0.0
[TOTAL_GCs], Count, 0
[TOTAL_GC_TIME], Time(ms), 0
[TOTAL_GC_TIME_%], Time(%), 0.0
[READ], Operations, 95000
[READ], AverageLatency(us), 38.27523157894737
[READ], MinLatency(us), 23
[READ], MaxLatency(us), 2943
[READ], 95thPercentileLatency(us), 56
[READ], 99thPercentileLatency(us), 71
[READ], Return=OK, 95000
[CLEANUP], Operations, 1
[CLEANUP], AverageLatency(us), 2945.0
[CLEANUP], MinLatency(us), 2944
[CLEANUP], MaxLatency(us), 2945
[CLEANUP], 95thPercentileLatency(us), 2945
[CLEANUP], 99thPercentileLatency(us), 2945
[INSERT], Operations, 5000
[INSERT], AverageLatency(us), 47.04
[INSERT], MinLatency(us), 28
[INSERT], MaxLatency(us), 737
[INSERT], 95thPercentileLatency(us), 69
[INSERT], 99thPercentileLatency(us), 118
[INSERT], Return=OK, 5000
total zerocopy send size = 0, total send size = 22156416, 0.000000
[OVERALL], RunTime(ms), 4217
[OVERALL], OP, 100000
[OVERALL], Throughput(ops/sec), 23713.540431586436
[TOTAL_GCS_PS_Scavenge], Count, 0
[TOTAL_GC_TIME_PS_Scavenge], Time(ms), 0
[TOTAL_GC_TIME_%_PS_Scavenge], Time(%), 0.0
[TOTAL_GCS_PS_MarkSweep], Count, 0
[TOTAL_GC_TIME_PS_MarkSweep], Time(ms), 0
[TOTAL_GC_TIME_%_PS_MarkSweep], Time(%), 0.0
[TOTAL_GCs], Count, 0
[TOTAL_GC_TIME], Time(ms), 0
[TOTAL_GC_TIME_%], Time(%), 0.0
[READ], Operations, 95046
[READ], AverageLatency(us), 40.24691202154746
[READ], MinLatency(us), 23
[READ], MaxLatency(us), 2973
[READ], 95thPercentileLatency(us), 59
[READ], 99thPercentileLatency(us), 74
[READ], Return=OK, 95046
[CLEANUP], Operations, 1
[CLEANUP], AverageLatency(us), 2235.0
[CLEANUP], MinLatency(us), 2234
[CLEANUP], MaxLatency(us), 2235
[CLEANUP], 95thPercentileLatency(us), 2235
[CLEANUP], 99thPercentileLatency(us), 2235
[INSERT], Operations, 4954
[INSERT], AverageLatency(us), 49.389987888574886
[INSERT], MinLatency(us), 29
[INSERT], MaxLatency(us), 714
[INSERT], 95thPercentileLatency(us), 71
[INSERT], 99thPercentileLatency(us), 110
[INSERT], Return=OK, 4954
total zerocopy send size = 0, total send size = 22121456, 0.000000
[OVERALL], RunTime(ms), 4291
[OVERALL], OP, 100000
[OVERALL], Throughput(ops/sec), 23304.59100442787
[TOTAL_GCS_PS_Scavenge], Count, 0
[TOTAL_GC_TIME_PS_Scavenge], Time(ms), 0
[TOTAL_GC_TIME_%_PS_Scavenge], Time(%), 0.0
[TOTAL_GCS_PS_MarkSweep], Count, 0
[TOTAL_GC_TIME_PS_MarkSweep], Time(ms), 0
[TOTAL_GC_TIME_%_PS_MarkSweep], Time(%), 0.0
[TOTAL_GCs], Count, 0
[TOTAL_GC_TIME], Time(ms), 0
[TOTAL_GC_TIME_%], Time(%), 0.0
[READ], Operations, 95075
[READ], AverageLatency(us), 40.97555613988956
[READ], MinLatency(us), 24
[READ], MaxLatency(us), 1689
[READ], 95thPercentileLatency(us), 60
[READ], 99thPercentileLatency(us), 75
[READ], Return=OK, 95075
[CLEANUP], Operations, 1
[CLEANUP], AverageLatency(us), 4366.0
[CLEANUP], MinLatency(us), 4364
[CLEANUP], MaxLatency(us), 4367
[CLEANUP], 95thPercentileLatency(us), 4367
[CLEANUP], 99thPercentileLatency(us), 4367
[INSERT], Operations, 4925
[INSERT], AverageLatency(us), 49.26477157360406
[INSERT], MinLatency(us), 29
[INSERT], MaxLatency(us), 2787
[INSERT], 95thPercentileLatency(us), 68
[INSERT], 99thPercentileLatency(us), 102
[INSERT], Return=OK, 4925
total zerocopy send size = 0, total send size = 22346738, 0.000000
[OVERALL], RunTime(ms), 4447
[OVERALL], OP, 100000
[OVERALL], Throughput(ops/sec), 22487.069934787498
[TOTAL_GCS_PS_Scavenge], Count, 0
[TOTAL_GC_TIME_PS_Scavenge], Time(ms), 0
[TOTAL_GC_TIME_%_PS_Scavenge], Time(%), 0.0
[TOTAL_GCS_PS_MarkSweep], Count, 0
[TOTAL_GC_TIME_PS_MarkSweep], Time(ms), 0
[TOTAL_GC_TIME_%_PS_MarkSweep], Time(%), 0.0
[TOTAL_GCs], Count, 0
[TOTAL_GC_TIME], Time(ms), 0
[TOTAL_GC_TIME_%], Time(%), 0.0
[READ], Operations, 94906
[READ], AverageLatency(us), 42.448928413377445
[READ], MinLatency(us), 23
[READ], MaxLatency(us), 927
[READ], 95thPercentileLatency(us), 63
[READ], 99thPercentileLatency(us), 80
[READ], Return=OK, 94906
[CLEANUP], Operations, 1
[CLEANUP], AverageLatency(us), 2397.0
[CLEANUP], MinLatency(us), 2396
[CLEANUP], MaxLatency(us), 2397
[CLEANUP], 95thPercentileLatency(us), 2397
[CLEANUP], 99thPercentileLatency(us), 2397
[INSERT], Operations, 5094
[INSERT], AverageLatency(us), 53.99744797801335
[INSERT], MinLatency(us), 31
[INSERT], MaxLatency(us), 2985
[INSERT], 95thPercentileLatency(us), 76
[INSERT], 99thPercentileLatency(us), 115
[INSERT], Return=OK, 5094
total zerocopy send size = 0, total send size = 22277539, 0.000000
[OVERALL], RunTime(ms), 4778
[OVERALL], OP, 100000
[OVERALL], Throughput(ops/sec), 20929.25910422771
[TOTAL_GCS_PS_Scavenge], Count, 0
[TOTAL_GC_TIME_PS_Scavenge], Time(ms), 0
[TOTAL_GC_TIME_%_PS_Scavenge], Time(%), 0.0
[TOTAL_GCS_PS_MarkSweep], Count, 0
[TOTAL_GC_TIME_PS_MarkSweep], Time(ms), 0
[TOTAL_GC_TIME_%_PS_MarkSweep], Time(%), 0.0
[TOTAL_GCs], Count, 0
[TOTAL_GC_TIME], Time(ms), 0
[TOTAL_GC_TIME_%], Time(%), 0.0
[READ], Operations, 94943
[READ], AverageLatency(us), 45.73697902952298
[READ], MinLatency(us), 21
[READ], MaxLatency(us), 2983
[READ], 95thPercentileLatency(us), 71
[READ], 99thPercentileLatency(us), 86
[READ], Return=OK, 94943
[CLEANUP], Operations, 1
[CLEANUP], AverageLatency(us), 2537.0
[CLEANUP], MinLatency(us), 2536
[CLEANUP], MaxLatency(us), 2537
[CLEANUP], 95thPercentileLatency(us), 2537
[CLEANUP], 99thPercentileLatency(us), 2537
[INSERT], Operations, 5057
[INSERT], AverageLatency(us), 57.01226023333992
[INSERT], MinLatency(us), 29
[INSERT], MaxLatency(us), 885
[INSERT], 95thPercentileLatency(us), 78
[INSERT], 99thPercentileLatency(us), 114
[INSERT], Return=OK, 5057
total zerocopy send size = 0, total send size = 22222904, 0.000000
[OVERALL], RunTime(ms), 4862
[OVERALL], OP, 100000
[OVERALL], Throughput(ops/sec), 20567.667626491155
[TOTAL_GCS_PS_Scavenge], Count, 0
[TOTAL_GC_TIME_PS_Scavenge], Time(ms), 0
[TOTAL_GC_TIME_%_PS_Scavenge], Time(%), 0.0
[TOTAL_GCS_PS_MarkSweep], Count, 0
[TOTAL_GC_TIME_PS_MarkSweep], Time(ms), 0
[TOTAL_GC_TIME_%_PS_MarkSweep], Time(%), 0.0
[TOTAL_GCs], Count, 0
[TOTAL_GC_TIME], Time(ms), 0
[TOTAL_GC_TIME_%], Time(%), 0.0
[READ], Operations, 95003
[READ], AverageLatency(us), 46.533993663358
[READ], MinLatency(us), 21
[READ], MaxLatency(us), 2929
[READ], 95thPercentileLatency(us), 71
[READ], 99thPercentileLatency(us), 87
[READ], Return=OK, 95003
[CLEANUP], Operations, 1
[CLEANUP], AverageLatency(us), 2513.0
[CLEANUP], MinLatency(us), 2512
[CLEANUP], MaxLatency(us), 2513
[CLEANUP], 95thPercentileLatency(us), 2513
[CLEANUP], 99thPercentileLatency(us), 2513
[INSERT], Operations, 4997
[INSERT], AverageLatency(us), 58.239943966379826
[INSERT], MinLatency(us), 24
[INSERT], MaxLatency(us), 893
[INSERT], 95thPercentileLatency(us), 80
[INSERT], 99thPercentileLatency(us), 156
[INSERT], Return=OK, 4997